wisteria-1c/Конфигурация/DataProcessors/СоздатьСайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СоздатьСайт</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НастройкиЗаписьНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗаписьНаУслуги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаписьНаУслугиИсточник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.УдалитьОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОтборовНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатурыПоставщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ЗаписьНаУслугиИсточник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЗаписьНаУслугиИсточник</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чатбот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/СоздатьСайт/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаДлительнойОперации, 
	ИнтервалПроверкиИмениСайта, 
	ИнтервалПроверкиСозданияСайта, 
	РазрешенныеСимволыИмениСайта,
	ДанныеСозданияСайтаСтруктура;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	ДоступнаЗаписьНаУслуги = ВозможностиПриложения.КонстантаДоступнаВПриложении("ФункциональнаяОпцияИспользоватьПодсистемуРаботы");
	Элементы.ЗаписьНаУслуги.Видимость = ДоступнаЗаписьНаУслуги;
	
	// Получить организацию для формирования имени сайта
	ОсновнаяОрганизация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
	Если НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	// Получить email для регистрации сайта
	EmailРегистрацииСайта = ПечатьДокументовУНФ.КонтактнаяИнформация(
		ТекПользователь, 
		Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		
	ВидЦен = Справочники.ВидыЦен.Оптовая;
	ИмяСайта = ПолучитьИмяСайтаИзИмениОрганизации();
	ПринимаюСоглашение = Ложь;
	ЗаполнитьГруппыКатегории();
	
	ПроверитьУслугиРесурсы();
	
	ТипСайта = 4;
	
	Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно);;
	
	// Загрузить виды бизнеса
	ЗаполнитьВидыБизнеса();
	
	// Загрузить шаблоны сайтов
	ЗагрузитьШаблоныССайта();
	
	ВидБизнесаКонстанта = Константы.ВидБизнесаОрганизации.Получить();
	Если ЗначениеЗаполнено(ВидБизнесаКонстанта) Тогда
		ВидБизнесаМассив = ВидыБизнеса.НайтиСтроки(Новый Структура("Идентификатор",ВидБизнесаКонстанта));
		Если ВидБизнесаМассив.Количество()>0 Тогда
			ШаблонСайтаОписание = ВидБизнесаМассив[0].Наименование;
			ДанныеВыбора = ОбновитьСписокШаблоновСайтов(ШаблонСайтаОписание);
			Если ДанныеВыбора.Количество()>0 Тогда
				ШаблонСайтаОписание = ДанныеВыбора[0].Значение;
			Иначе
				ШаблонСайтаОписание = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		ЭтоМобильныйКлиент = Истина;
		
		Элементы.ГруппаАдресСайта.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
	КонецЕсли;

	КаналыПродажСервер.МенюСтраницИнициализация( ЭтаФорма );
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КаналыПродажКлиент.МенюСтраницПерейти( ЭтаФорма );
	
	РазрешенныеСимволыИмениСайта = Новый Соответствие;
	СтрСимволы = "qwertyuiopasdfghjklzxcvbnm01234567890-";
	Для НомерСимвола = 1 По СтрДлина(СтрСимволы) Цикл
		РазрешенныеСимволыИмениСайта.Вставить(Сред(СтрСимволы, НомерСимвола, 1), Истина);
	КонецЦикла;
	
	ОбновитьВидимостьНастроек();
	
	ИнтервалПроверкиИмениСайта = 2;
	ИнтервалПроверкиСозданияСайта = 4;
	ПодключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта", 0.1, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЛицензионноеСоглашениеСсылкаНажатие(Элемент)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://umi.ru/servicelicense/");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорииИерархияПереключательПриИзменении(Элемент)
	
	Если ОтборКатегорииГруппыПереключатель = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.КатегорииНоменклатуры") Тогда
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.КатегорииОтбор;
	ИначеЕсли ОтборКатегорииГруппыПереключатель = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры") Тогда
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.ГруппыОтбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСайтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ИмяСайтаПроверено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИмяСайта(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСайтаПриИзменении(Элемент)
	
	ИмяСайтаИзмененоВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяОрганизацияПриИзменении(Элемент)
	
	Если НЕ ИмяСайтаИзмененоВручную Тогда
		ИмяСайта = ПолучитьИмяСайтаИзИмениОрганизации();
		ОбновитьИмяСайта(ИмяСайта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСайтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СокрЛП( Текст ) = "" И СокрЛП( Элемент.ТекстРедактирования ) = "" Тогда
		
		Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = НСтр( "ru = 'Заполните имя сайта'" );
		
		ИмяСайтаПроверено = Ложь;
		ОтключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта");
		
	ИначеЕсли ИмяСайта<>Элемент.ТекстРедактирования Тогда
		
		ИмяСайтаПроверено = Ложь;
		
		Если НЕ ПроверитьИмяСайтаТекст(Текст) Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно);
		
		ОтключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта");
		ПодключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта", ИнтервалПроверкиИмениСайта, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦены(Элемент)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://umi.ru/price/");

КонецПроцедуры

&НаКлиенте
Процедура ШаблонСайтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) И СтрДлина(СокрЛП(Текст))>=3 Тогда
		СтандартнаяОбработка = Ложь;
		ШаблонСайтаНомер = 0;
		
		ДанныеВыбора = ОбновитьСписокШаблоновСайтов(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ШаблонСайтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОтборТипСайта = ТипСайтаПоНомеру(ТипСайта);
	ШаблоныОтбор = Новый Структура("ТипСайта", ОтборТипСайта);
	ВыбранныеШаблоны = ШаблоныСайтов.НайтиСтроки(ШаблоныОтбор);
	СписокШаблонов = Новый СписокЗначений;
	Для Каждого стр Из ВыбранныеШаблоны Цикл
		СписокШаблонов.Добавить(стр.Наименование, стр.Наименование);
	КонецЦикла;
	
	НачальноеЗначениеСписка = СписокШаблонов.НайтиПоЗначению(ШаблонСайтаОписание);
	
	Результат = Ждать ВыбратьИзСпискаАсинх( СписокШаблонов, , НачальноеЗначениеСписка);
	Если ТипЗнч( Результат ) <> Тип( "ЭлементСпискаЗначений" ) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСайтаОписание = Результат.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьНаУслугиПриИзменении(Элемент)
	
	СтруктураНастроек = Новый Структура;
	Если НЕ ПроверитьУстановкуКонстант(СтруктураНастроек) Тогда
		ТекстВопроса = НСтр("ru = 'Для онлайн-записи на услугу в 1С нужно включить настройки:' ");
		ТекстВопроса = ТекстВопроса + ?(СтруктураНастроек.ИспользоватьРаботы, "", Символы.ПС+НСтр("ru = 'Работы - Выполнение работ и оказание услуг'"));
		ТекстВопроса = ТекстВопроса + ?(СтруктураНастроек.ПланироватьЗагрузкуРесурсов, "", Символы.ПС+НСтр("ru = 'Работы - Планировать загрузку ресурсов'"));
		ТекстВопроса = ТекстВопроса + ?(СтруктураНастроек.ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи, "", Символы.ПС+НСтр("ru = 'Работы - использовать журнал записи'"));
		
		ТекстВопроса = ТекстВопроса + Символы.ПС+НСтр("ru = 'Включить эти настройки сейчас?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьНастройкиЗаписьНаУслугу", ЭтотОбъект, СтруктураНастроек), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	ОбновитьВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМастераОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Открыть подсказку" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Публикация на web-сервере'"));
		ПараметрыОткрытия.Вставить("КлючПодсказки", "СозданиеСайтаОнлайнЗаписьНаУслугу");
		ОткрытьФорму("Обработка.МенеджерПодсказок.Форма", ПараметрыОткрытия);
	Иначе	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыМенюСтраниц

&НаКлиенте
Процедура МенюСтраницПриАктивизацииСтроки(Элемент)
	// обязательно через обработчик ожидания
	ПодключитьОбработчикОжидания( "МенюСтраницПерейтиПриАктивизацииСтроки", 0.1, Истина );
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборКатегории

&НаКлиенте
Процедура ДеревоКатегорииВыбранПриИзменении()
	
	ПометкаПриИзменении("ОтборКатегории");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборИерархия

&НаКлиенте
Процедура ДеревоИерархииВыбранПриИзменении()
	
	ПометкаПриИзменении("ОтборИерархия");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиЗаписьНаУслуги

&НаКлиенте
Процедура НастройкиЗаписьНаУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуРедактирования(ТекСтрока);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НастройкиЗаписьНаУслугиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для каждого стр Из Строки Цикл
		стр.Значение.Данные.УслугаРесурс = стр.Ключ.Ресурс;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗаписьНаУслугиПередНачаломИзменения(Элемент, Отказ)

	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ОткрытьФормуРедактирования(ТекСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗаписьНаУслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ОткрытьФормуРедактирования();

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьИмяСайта(Команда)
	ПроверитьИмяСайтаНаСервере(Элементы.ИмяСайта.ТекстРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСайт(Команда)
	
	Если ТипСайта = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите тип сайта.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ПринимаюСоглашение Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для создания сайта необходимо принять лицензионное соглашение.'"));
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(EmailРегистрацииСайта) = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите e-mail, на который будет зарегистрирован сайт.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ИмяСайтаПроверено Тогда
		 ПроверитьИмяСайтаНаСервере(Элементы.ИмяСайта.ТекстРедактирования);
	КонецЕсли;
	 
	Если НЕ ИмяСайтаСвободно Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Имя сайта занято, выберите другое.'"));
		Возврат;
	КонецЕсли;
	
	ФормаДлительнойОперации = ПолучитьФорму("Обработка.СоздатьСайт.Форма.ДлительнаяОперация");
	ФормаДлительнойОперации.ВладелецФормы = ЭтотОбъект;
	ФормаДлительнойОперации.Открыть();
	
	СчетчикОжиданияСозданияСайта = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Попытка
	
		ДанныеСозданияСайтаСтруктура = СоздатьСайтВФоне();
		
	Исключение
	
		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Если ДанныеСозданияСайтаСтруктура.Свойство("ОжиданиеСозданияСайта") И ДанныеСозданияСайтаСтруктура.ОжиданиеСозданияСайта = Истина Тогда
		
		ФормаДлительнойОперации.ФоновоеЗаданиеИдентификатор = ФоновоеЗаданиеИдентификатор;
		ПодключитьОбработчикОжидания("СоздатьСайтПродолжить", 2, Истина);
		
	ИначеЕсли ДанныеСозданияСайтаСтруктура.Свойство("Ошибка") Тогда
	
		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеСозданияСайтаСтруктура.Ошибка);
		
	Иначе
	
		ФормаДлительнойОперации.ФоновоеЗаданиеИдентификатор = ФоновоеЗаданиеИдентификатор;
		ПодключитьОбработчикОжидания("ПроверитьВыполнение", ИнтервалПроверкиСозданияСайта, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияУстановитьФлажки(Команда)
	УстановитьПометку(Истина, "ОтборИерархия");
КонецПроцедуры

&НаКлиенте
Процедура ОтборИерархияСнятьФлажки(Команда)
	УстановитьПометку(Ложь, "ОтборИерархия");
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорииУстановитьФлажки(Команда)
	УстановитьПометку(Истина, "ОтборКатегории");
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорииСнятьФлажки(Команда)
	УстановитьПометку(Ложь, "ОтборКатегории");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьСайтВФоне()
	
	ПараметрыСозданияСайта = ПараметрыСозданияСайта();
	НаименованиеЗадания = НСтр("ru = 'Создание сайта'");
	ИмяПроцедуры = "Обработки.СоздатьСайт.СоздатьСайт";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыСозданияСайта, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		ПараметрыСозданияСайта = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Иначе
		ФоновоеЗаданиеИдентификатор  = РезультатВыполнения.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатВыполнения.АдресРезультата;
	КонецЕсли;
	
	Возврат ПараметрыСозданияСайта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоменЮми()
	
	Возврат "1c-umi";
	
КонецФункции

&НаСервере
Функция ПараметрыСозданияСайта(ПараметрыВызоваСервера = Неопределено)
	
	АдресСайта = ИмяСайта +  "." + ДоменЮми() + ".ru";	
	
	Если ПараметрыВызоваСервера = Неопределено Тогда
		ПараметрыВызоваСервера = Новый Структура;
	КонецЕсли;
	ПараметрыВызоваСервера.Вставить("ТипСайта", ТипСайта);
	Если ШаблонСайтаНомер=0 Тогда
		Если ТипСайта=1 Тогда
			ПараметрыВызоваСервера.Вставить("desID", "1063");
		ИначеЕсли ТипСайта=2 Тогда
			ПараметрыВызоваСервера.Вставить("desID", "1813");
		ИначеЕсли ТипСайта=3 Тогда
			ПараметрыВызоваСервера.Вставить("desID", "1566");
		ИначеЕсли ТипСайта=4 Тогда
			ПараметрыВызоваСервера.Вставить("desID", "1591");
		КонецЕсли;
	Иначе
		ПараметрыВызоваСервера.Вставить("desID", Формат(ШаблонСайтаНомер,"ЧГ=0"));
	КонецЕсли; 
	
	ПараметрыВызоваСервера.Вставить("ОсновнаяОрганизация", ОсновнаяОрганизация);
	ПараметрыВызоваСервера.Вставить("ИмяСайта", ИмяСайта);
	ПараметрыВызоваСервера.Вставить("АдресСайта", АдресСайта);
	ПараметрыВызоваСервера.Вставить("EmailРегистрацииСайта", EmailРегистрацииСайта);
	ПараметрыВызоваСервера.Вставить("ОтборКатегорииГруппыПереключатель", ОтборКатегорииГруппыПереключатель);
	ПараметрыВызоваСервера.Вставить("ВидЦен", ВидЦен);
	ПараметрыВызоваСервера.Вставить("ВыгружатьОстатки", Ложь);
	
	ПараметрыВызоваСервера.Вставить("ОтборКатегорииГруппыПереключатель", ОтборКатегорииГруппыПереключатель);
	Если ТипСайта=4 И (АдресТаблицыКаталогов = "") Тогда
		АдресТаблицыКаталогов = ПоместитьВоВременноеХранилище(ПолучитьТаблицуКаталогов(), Новый УникальныйИдентификатор);
		ПараметрыВызоваСервера.Вставить("ТаблицаКаталогов", АдресТаблицыКаталогов);
	Иначе
		ПараметрыВызоваСервера.Вставить("ТаблицаКаталогов", АдресТаблицыКаталогов);
	КонецЕсли;
	
	ПараметрыВызоваСервера.Вставить("ЗаписьНаУслуги", ЗаписьНаУслуги);
	
	Возврат ПараметрыВызоваСервера;
	
КонецФункции

&НаСервере
Функция СоздатьСайтВФонеПродолжить(ПараметрыСозданияСайта)
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение сайта'");
	ИмяПроцедуры = "Обработки.СоздатьСайт.СоздатьСайтПродолжить";
	
	Если ТипСайта = 4 Тогда
		ХранилищеСистемныхНастроек.Сохранить("ТаблицаКаталоговСозданияСайта",,ПолучитьТаблицуКаталогов());
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыСозданияСайта, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		ПараметрыСозданияСайта = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Иначе
		ФоновоеЗаданиеИдентификатор  = РезультатВыполнения.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатВыполнения.АдресРезультата;
	КонецЕсли;
	
	Возврат ПараметрыСозданияСайта;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуКаталогов()

	// Таблица каталогов.
	ВсеГруппы = Ложь;
	СписокГрупп = Новый СписокЗначений;
	Если ОтборКатегорииГруппыПереключатель = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры Тогда
		ГруппыВДереве = ОтборИерархия.ПолучитьЭлементы();
		Если ГруппыВДереве.Количество()=0 Тогда
			// НЕ выгружаем товары, если категории не введены
			ВсеГруппы = Истина;
			СписокГрупп.Добавить(Справочники.Номенклатура.ПустаяСсылка(),"(Все)");
		Иначе
			НайтиВыделенныеСтроки(ГруппыВДереве, СписокГрупп);
		КонецЕсли;
	Иначе	
		КатегорииВДереве = ОтборКатегории.ПолучитьЭлементы();
		Если КатегорииВДереве.Количество()=0 Тогда
			// НЕ выгружаем товары, если категории не введены
			ВсеГруппы = Истина;
			СписокГрупп.Добавить(Справочники.КатегорииНоменклатуры.ПустаяСсылка(),"(Все)");
		Иначе
			НайтиВыделенныеСтроки(КатегорииВДереве, СписокГрупп);
		КонецЕсли;
	КонецЕсли;

	Если СписокГрупп.Количество()=0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли; 
	
	Если НЕ ВсеГруппы Тогда
		
		// Удаляем дубли и подчиненные элементы.
		МассивУдалить = Новый Массив;
		Для Каждого ЭлементСЗ Из СписокГрупп Цикл
			Если НЕ МассивУдалить.Найти(ЭлементСЗ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТекГруппа = ЭлементСЗ.Значение;
			Если ЭлементСЗ.Представление = НСтр("ru = '<Все группы>'") Тогда
				МассивУдалить.Добавить(ЭлементСЗ);
				Продолжить;
			КонецЕсли;
			
			Для Каждого элСписка Из СписокГрупп Цикл
				Если НЕ МассивУдалить.Найти(элСписка) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(элСписка.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ элСписка = ЭлементСЗ
					И элСписка.Значение = ТекГруппа Тогда
					МассивУдалить.Добавить(элСписка);
				Иначе
					Если элСписка.Значение.ПринадлежитЭлементу(ТекГруппа) Тогда
						МассивУдалить.Добавить(элСписка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ЭлементМУ Из МассивУдалить Цикл
			СписокГрупп.Удалить(ЭлементМУ);
		КонецЦикла;
	
	КонецЕсли; 
	
	ТаблицаКаталоговТЗ = Новый ТаблицаЗначений;
	ТаблицаКаталоговТЗ.Колонки.Добавить("Каталог", Новый ОписаниеТипов("Строка", ,
												   Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаКаталоговТЗ.Колонки.Добавить("Группы",  Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаКаталоговТЗ.Колонки.Добавить("ИдентификаторКаталога", Новый ОписаниеТипов("Строка", ,
												   Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
    ТаблицаКаталоговТЗ.Колонки.Добавить("ХранилищеНастроекКомпоновки", Новый ОписаниеТипов("ХранилищеЗначения"));
	ТаблицаКаталоговТЗ.Колонки.Добавить("РучнаяНастройкаКаталога", Новый ОписаниеТипов("Число",
																   Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	
	НовСтр = ТаблицаКаталоговТЗ.Добавить();
	НовСтр.Каталог = НСтр("ru = 'Основной каталог товаров'");
	НовСтр.ИдентификаторКаталога = Строка(Новый УникальныйИдентификатор);
	НовСтр.Группы = СписокГрупп;
	
	Возврат ТаблицаКаталоговТЗ;

КонецФункции

&НаСервере
Функция НайтиВыделенныеСтроки(СписокЭлементов, СписокВыделенных)
	
	Для каждого стрДерева Из СписокЭлементов Цикл
		Если стрДерева.Флаг Тогда
			СписокВыделенных.Добавить(стрДерева.Значение, стрДерева.Представление);
		КонецЕсли;
		
		ДочерниеСтроки = стрДерева.ПолучитьЭлементы();
		Если ДочерниеСтроки.Количество()>0 Тогда
			НайтиВыделенныеСтроки(ДочерниеСтроки,СписокВыделенных);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВыделенных;
	
КонецФункции

&НаСервере
Процедура ДобавитьПараметрыЗапроса(АдресЗапроса, ПараметрыЗапроса)
	
	РазделительПараметров = "?";
	Для каждого стр Из ПараметрыЗапроса Цикл
		АдресЗапроса = АдресЗапроса + РазделительПараметров + стр.Ключ+"="+стр.Значение;
		РазделительПараметров = "&";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИмяСайтаНаСервере(Знач ИмяСайтаДляПроверки = "")

	Если ИмяСайтаДляПроверки = "" Тогда
		ИмяСайтаДляПроверки = ИмяСайта;
	КонецЕсли;
	
	РеквизитыАвторизации = Обработки.СоздатьСайт.ДанныеДляАвторизации();
	
	АдресЗапроса = РеквизитыАвторизации.Получить("АдресЗапроса");
	РеквизитыАвторизации.Вставить("host", ИмяСайтаДляПроверки + "." + ДоменЮми() + ".ru");
	РеквизитыАвторизации.Вставить("action", "check_free");
	ДобавитьПараметрыЗапроса(АдресЗапроса, РеквизитыАвторизации);
		
	СтруктураДанныхСоздания = Новый Структура;
	СтруктураДанныхСоздания.Вставить("ТелоЗапроса", Неопределено);
	
	СтруктураДанныхСоздания.Вставить("АдресЗапроса",
		ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресЗапроса));
		
	ТекстОшибки = "";
	ДанныеСтрока = ПолучитьДанныеЗапросом("GET", СтруктураДанныхСоздания.ТелоЗапроса, СтруктураДанныхСоздания.АдресЗапроса, Новый Структура,,,,ТекстОшибки);
	Если ТекстОшибки="" Тогда
		ИмяСайтаСвободно = ПрочитатьРеквизитJSON(ДанныеСтрока, "result");
		ИмяСайтаПроверено = Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСайтПродолжить()

	ДанныеСайтаСтруктура = ПроверитьГотовностьСайтаНаСервере();
	
	Если ДанныеСайтаСтруктура.Свойство("Ошибка") Тогда
		 ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеСайтаСтруктура.Ошибка);
	ИначеЕсли ДанныеСайтаСтруктура.Свойство("СайтСоздан") И ДанныеСайтаСтруктура.СайтСоздан = Истина Тогда
		
		ДанныеСозданияСайтаСтруктура.СайтСоздан = Истина;
		РезультатСозданияПослеЗаполнения = СоздатьСайтВФонеПродолжить(ДанныеСозданияСайтаСтруктура);
		
		Если РезультатСозданияПослеЗаполнения.Свойство("ОбменВыполнен") И РезультатСозданияПослеЗаполнения.ОбменВыполнен=Истина Тогда
			ОткрытьСозданныйСайт(РезультатСозданияПослеЗаполнения);
		Иначе
			ПодключитьОбработчикОжидания("ПроверитьВыполнение", ИнтервалПроверкиСозданияСайта, Истина);
		КонецЕсли;
	ИначеЕсли ДанныеСайтаСтруктура.Свойство("СайтСоздан") И ДанныеСайтаСтруктура.СайтСоздан = Ложь Тогда
		
		Если (ОбщегоНазначенияКлиент.ДатаСеанса() - СчетчикОжиданияСозданияСайта) > 1800 Тогда // ждем создания сайта не более 30 мин, потом выдаем ошибку
			ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Время ответа от сайта превышено, попробуйте повторить операцию позже'"));
			Возврат;
		Иначе	
			ПодключитьОбработчикОжидания("СоздатьСайтПродолжить", 2, Истина);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнение()
	
	Попытка
		РезультатПроверки = ПроверитьВыполнениеНаСервере(ФоновоеЗаданиеИдентификатор, ФоновоеЗаданиеАдресХранилища, Ложь);
	Исключение
		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если РезультатПроверки.ЗаданиеВыполнено Тогда
		
		ДействияЗаданиеВыполнено(РезультатПроверки);
		
	ИначеЕсли ДанныеСозданияСайтаСтруктура.Свойство("Ошибка") Тогда
		ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеСозданияСайтаСтруктура.Ошибка);
		
	Иначе
		ПодключитьОбработчикОжидания("ПроверитьВыполнение", ИнтервалПроверкиСозданияСайта, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьГотовностьСайтаНаСервере()

	ПараметрыСозданияСайта = ПараметрыСозданияСайта();
	ДанныеСайта = Обработки.СоздатьСайт.ПолучитьДанныеСозданияСайта(ПараметрыСозданияСайта);
	
	ДанныеСайтаСтруктура = Новый Структура;
	Если ТипЗнч(ДанныеСайта)= Тип("Соответствие") Тогда
		СайтСоздан = ДанныеСайта.Получить("ready");
		ОжиданиеСозданияСайта = ДанныеСайта.Получить("waiting");
		
		ДанныеСайтаСтруктура.Вставить("СайтСоздан", СайтСоздан);
		ДанныеСайтаСтруктура.Вставить("ОжиданиеСозданияСайта", ОжиданиеСозданияСайта);
		
		Возврат ДанныеСайтаСтруктура;
	Иначе
		Возврат Новый Структура("Ошибка", ДанныеСайта);
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ДействияЗаданиеВыполнено(РезультатПроверки)
	
	Если ТипЗнч(РезультатПроверки.Значение) = Тип("Структура") Тогда
		
		Если РезультатПроверки.Значение.Свойство("Ошибка") Тогда
			
			ТекстОшибки = РезультатПроверки.Значение.Ошибка;
			Если ТипЗнч(ТекстОшибки)=Тип("Массив") Тогда
				Для каждого стр Из ТекстОшибки Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(стр);
				КонецЦикла;
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
		Иначе	
			
			ДанныеСозданияСайтаСтруктура = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
			
			Если ТипЗнч(ДанныеСозданияСайтаСтруктура) = Тип("Структура") И ДанныеСозданияСайтаСтруктура.Свойство("ОбменВыполнен") 
				И ДанныеСозданияСайтаСтруктура.Свойство("СсылкаАдминЗоны") Тогда
				
				// сайт создан и заполнен данными
				ОткрытьСозданныйСайт(ДанныеСозданияСайтаСтруктура);
				
			ИначеЕсли ТипЗнч(ДанныеСозданияСайтаСтруктура) = Тип("Структура") И ДанныеСозданияСайтаСтруктура.Свойство("СсылкаАдминЗоны") Тогда
				 // сайт создан, нужно запустить обмен
				
				 СоздатьСайтПродолжить();
				
			ИначеЕсли ТипЗнч(ДанныеСозданияСайтаСтруктура) = Тип("Структура") И ДанныеСозданияСайтаСтруктура.Свойство("Ошибка") Тогда
				ТекстОшибки = ДанныеСозданияСайтаСтруктура.Ошибка;
				Если ТипЗнч(ТекстОшибки)=Тип("Массив") Тогда
					Для каждого стр Из ТекстОшибки Цикл
						ОбщегоНазначенияКлиент.СообщитьПользователю(стр);
					КонецЦикла;
				Иначе
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСозданныйСайт(ДанныеСозданияСайтаСтруктура)
	
	ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://"+ДанныеСозданияСайтаСтруктура.АдресСайта);
	Если ЗаписьНаУслуги Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрЗаменить(ДанныеСозданияСайтаСтруктура.СсылкаАдминЗоны, "/adminzone/","/adminzone/content/appointments/"));
	Иначе
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрЗаменить(ДанныеСозданияСайтаСтруктура.СсылкаАдминЗоны, "/adminzone/","/adminzone/main/"));
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(,,НСтр("ru = 'Создан сайт:' ")+ДанныеСозданияСайтаСтруктура.АдресСайта,БиблиотекаКартинок.Информация32);
	ОбновитьИнтерфейс();
	
	Закрыть( Истина );
	
	Если ДанныеСозданияСайтаСтруктура.Свойство("НастройкаИнтеграции") Тогда
		ПоказатьЗначение(,ДанныеСозданияСайтаСтруктура.НастройкаИнтеграции);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеНаСервере(ФоновоеЗаданиеИдентификатор, ФоновоеЗаданиеАдресХранилища, ПрерватьЕслиНеВыполнено)
	РезультатПроверки = Новый Структура("ЗаданиеВыполнено, Значение", Ложь, Неопределено);
	Если ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
		РезультатПроверки.ЗаданиеВыполнено = Истина;
		РезультатПроверки.Значение         = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
	ИначеЕсли ПрерватьЕслиНеВыполнено Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
	Возврат РезультатПроверки;
КонецФункции

&НаСервере
Функция ПолучитьДанныеЗапросом(HTTPМетод, ТелоЗапроса, АдресЗапроса, ЗаголовкиЗапроса, 
	ContentType="", РазмерФайлаОтправки="", ИмяФайлаОтправки="", ТекстОшибки="")
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	HTTPСоединение = Новый HTTPСоединение(
		АдресЗапроса.Хост,
		АдресЗапроса.Порт,,, ИнтернетПрокси,
		1800,
		ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	
	Если ContentType="" Тогда
		ContentType = "application/json;charset=utf-8";
	КонецЕсли;
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса.ПутьНаСервере);
	ЗапросHTTP.Заголовки["Cache-Control"]	= "no-cache";
	ЗапросHTTP.Заголовки["Content-type"]	= ContentType;
	Для каждого стр Из ЗаголовкиЗапроса Цикл
		ЗапросHTTP.Заголовки[стр.Ключ]	= стр.Значение;
	КонецЦикла;
	
	Если ТипЗнч(ТелоЗапроса)=Тип("Строка") Тогда
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	ИначеЕсли ТипЗнч(ТелоЗапроса)=Тип("ДвоичныеДанные") Тогда
		ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
	ИначеЕсли ИмяФайлаОтправки<>"" Тогда
		ЗапросHTTP.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
	Иначе
		
	КонецЕсли; 
	
	Попытка
		Если HTTPМетод="GET" Тогда
		    ОтветHTTP = HTTPСоединение.Получить(ЗапросHTTP);
		ИначеЕсли HTTPМетод="POST" Тогда
			ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(ЗапросHTTP);
		ИначеЕсли HTTPМетод="PUT" Тогда
			ОтветHTTP = HTTPСоединение.Записать(ЗапросHTTP);
		ИначеЕсли HTTPМетод="DELETE" Тогда	
			ОтветHTTP = HTTPСоединение.Удалить(ЗапросHTTP);
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Если СтрНайти(ТекстОшибки, "Couldn't resolve host name")<>0 Тогда
		    ТекстОшибки = НСтр("ru = 'Ошибка: Не могу подключиться к интернету.'");
		КонецЕсли;
		Возврат "";
	КонецПопытки;
	
	Если ОтветHTTP.КодСостояния<>200 Тогда
		ОбщегоНазначения.СообщитьПользователю("Ответ сервера: " + ОтветHTTP.КодСостояния);
	КонецЕсли;

	ОтветКакСтрока = ОтветHTTP.ПолучитьТелоКакСтроку();
	Возврат ОтветКакСтрока;	
	
КонецФункции

&НаСервере
Функция ПрочитатьРеквизитJSON(ДанныеСтрока, ИмяРеквизита)
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтрока) Тогда
		Возврат 0;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	РеквизитЗначение = Результат.Получить(ИмяРеквизита);
	
	Возврат РеквизитЗначение;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации)
	
	Если ФормаДлительнойОперации.Открыта() Тогда
		ФормаДлительнойОперации.ЗакрытиеПодтверждено = Истина;
		ФормаДлительнойОперации.Закрыть();
	КонецЕсли;
	ФормаДлительнойОперации = Неопределено;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьНастроек()

	Если ТипСайта = 1 Тогда
		ТипСайтаПодсказка = НСтр( "ru = 'Обратная связь'" );
	ИначеЕсли ТипСайта = 2 Тогда
		ТипСайтаПодсказка = НСтр( "ru = 'Прием заявок'" );
	ИначеЕсли ТипСайта = 3 Тогда
		ТипСайтаПодсказка = НСтр( "ru = 'Обратная связь#Прием заявок'" );
	ИначеЕсли ТипСайта = 4 Тогда
		ТипСайтаПодсказка = НСтр( "ru = 'Обратная связь#Каталог товаров#Управление заказами#Продажи на сайте'" );
	КонецЕсли;
	Элементы.ТипСайта.РасширеннаяПодсказка.Заголовок = СтрЗаменить( ТипСайтаПодсказка, "#", Символы.ПС );

	ШаблонСайтаОписание = "";
	ШаблонСайтаНомер = 0;
	
	Если ТипСайта = 4 Тогда
		Элементы.ВидЦен.Доступность = Истина;
		КаналыПродажКлиентСервер.МенюСтраницПунктДоступностьУстановить( ЭтаФорма, "СтраницаИерархияНаСайте", Истина );
	Иначе
		Элементы.ВидЦен.Доступность = Ложь;
		КаналыПродажКлиентСервер.МенюСтраницПунктДоступностьУстановить( ЭтаФорма, "СтраницаИерархияНаСайте", Ложь );
	КонецЕсли;
	
	// запись на услуги
	ЗаписьНаУслугиДоступность = ТипСайта >= 3 И Не ЭтоРозница;
	Если ЗаписьНаУслугиДоступность = Ложь Тогда
		ЗаписьНаУслуги = Ложь;
	КонецЕсли;
	КаналыПродажКлиентСервер.МенюСтраницПунктДоступностьУстановить( ЭтаФорма, "СтраницаУслуги", ЗаписьНаУслугиДоступность );
	Элементы.ГруппаЗаписьНаУслуги.Доступность = ЗаписьНаУслуги И Не ЭтоРозница;
    
КонецПроцедуры

&НаКлиенте
Функция ПроверитьИмяСайтаТекст(Текст)
	
	Номер=1;
	Пока Номер <= СтрДлина(Текст) Цикл
		ПроверяемыйСимвол = Сред(Текст, Номер, 1);
		Если РазрешенныеСимволыИмениСайта.Получить(НРег(ПроверяемыйСимвол)) = Неопределено Тогда
			Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Разрешены латинские буквы и цифры'");
			Возврат Ложь;
		Иначе
			Номер = Номер+1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДоступностьИмениСайта() Экспорт
	
	Если ИмяСайтаПроверено Тогда
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(Элементы.ИмяСайта.ТекстРедактирования)="" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьИмяСайтаТекст(Элементы.ИмяСайта.ТекстРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИмяСайтаНаСервере(Элементы.ИмяСайта.ТекстРедактирования);
	Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьИмяСайта(Текст)
	
	Если Текст = "" Тогда
		Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = НСтр( "ru = 'Заполните имя сайта'" );
		
		ИмяСайтаПроверено = Ложь;
		ОтключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта");
		Возврат;
	ИначеЕсли НЕ ПроверитьИмяСайтаТекст(Текст) Тогда
		ИмяСайтаПроверено = Ложь;
		ОтключитьОбработчикОжидания("ПроверитьДоступностьИмениСайта");
		Возврат;
	КонецЕсли;
	
	Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно);
	ПроверитьИмяСайтаНаСервере(Элементы.ИмяСайта.ТекстРедактирования);
	Элементы.ИмяСайта.РасширеннаяПодсказка.Заголовок = ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьНадписьИмяСайтаДоступно(ИмяСайтаПроверено, ИмяСайтаСвободно)
	
	Если НЕ ИмяСайтаПроверено Тогда
		Возврат НСтр("ru = 'Проверяется ...'");
	ИначеЕсли ИмяСайтаСвободно Тогда
		Возврат НСтр("ru = 'Имя свободно'");
	Иначе
		Возврат НСтр("ru = 'Имя занято'");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидыБизнеса()
	
	МакетКлассификаторВидовБизнеса = ПолучитьОбщийМакет("КлассификаторВидовБизнеса").ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(МакетКлассификаторВидовБизнеса);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "biz" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Наименование = ЧтениеXML.ПолучитьАтрибут("name");
			Идентификатор = ЧтениеXML.ПолучитьАтрибут("id");
			
			НоваяСтрока = ВидыБизнеса.Добавить();
			НоваяСтрока.Наименование = Наименование;
			НоваяСтрока.Идентификатор = Число(Идентификатор);
			
		ИначеЕсли ЧтениеXML.Имя = "biz" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Продолжить;
			
		ИначеЕсли ЧтениеXML.Имя = "synonym" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ЧтениеXML.Прочитать();
			НоваяСтрока.Синонимы = НоваяСтрока.Синонимы + " " + ЧтениеXML.Значение;
			
		ИначеЕсли ЧтениеXML.Имя = "synonym" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаРедактированияОбработкаВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.НастройкиЗаписьНаУслуги.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометку(Пометка, ИмяТЧ)
	
	НоменклатураВДокументахКлиентСервер.УстановитьФлагУПодчиненных(ЭтотОбъект[ИмяТЧ].ПолучитьЭлементы(), "Флаг", Пометка);
	ТекущийЭлемент = Элементы[ИмяТЧ];
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиЗаписьНаУслугу(Результат, ДополнительныеПараметры) Экспорт
		
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
   		УстановитьКонстантыЗаписьНаУслугу(ДополнительныеПараметры);
		ОбновитьИнтерфейс();
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УбратьЗапрещенныеСимволы(Текст, Разрешенные)
	
	Результат = Текст;
	Для Сч = 1 По СтрДлина(Текст) Цикл
		ТекСимвол = Сред(Текст, Сч, 1);
		Если СтрНайти(Разрешенные, НРег(ТекСимвол))=0 Тогда
			Результат = СтрЗаменить(Результат, ТекСимвол,"");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСайтаПоНомеру(Номер)
	
	Если Номер=4 Тогда
		ОтборТипСайта = 11;
	ИначеЕсли Номер=3 Тогда
		ОтборТипСайта = 2;
	ИначеЕсли Номер=2 Тогда
		ОтборТипСайта = 10;
	ИначеЕсли Номер=1 Тогда
		ОтборТипСайта = 1;
	КонецЕсли;
	
	Возврат ОтборТипСайта; 
	
КонецФункции

&НаСервере
Функция СоответствиеВТЗ(МассивЗначений) 
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Если МассивЗначений.Количество()=0 Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	
	Для каждого элСоответствия Из МассивЗначений[0] Цикл
		ТаблицаЗначений.Колонки.Добавить(элСоответствия.Ключ);
	КонецЦикла; 
	Для каждого стр Из МассивЗначений Цикл
		НовСтр=ТаблицаЗначений.Добавить();
		Для каждого ЭлКлюч Из стр Цикл
			НовСтр[ЭлКлюч.Ключ] = ЭлКлюч.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция ПроверитьУстановкуКонстант(СтруктураНастроек)

	СтруктураНастроек.Вставить("ИспользоватьРаботы", 
	Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить());
	
	СтруктураНастроек.Вставить("ПланироватьЗагрузкуРесурсов", 
	Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия.Получить());
	
	СтруктураНастроек.Вставить("ПланироватьЗагрузкуРесурсовПредприятияРаботы", 
	Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияРаботы.Получить());
	
	СтруктураНастроек.Вставить("ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи", 
	Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи.Получить());
	
	Если СтруктураНастроек.ИспользоватьРаботы 
		И СтруктураНастроек.ПланироватьЗагрузкуРесурсов 
		И СтруктураНастроек.ПланироватьЗагрузкуРесурсовПредприятияРаботы 
		И СтруктураНастроек.ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи 
		Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоГрупп()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Значение,
	|	Номенклатура.Наименование КАК Представление,
	|	ВЫБОР
	|		КОГДА Номенклатура.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	ИСТИНА КАК Флаг
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование ИЕРАРХИЯ";
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СтрокаВсеГруппы = Дерево.Строки.Добавить();
	СтрокаВсеГруппы.Значение	 = Справочники.Номенклатура.ПустаяСсылка();
	СтрокаВсеГруппы.Представление= НСтр("ru = '<Нет группы>'");
	СтрокаВсеГруппы.Флаг = Истина;
	
	ЗначениеВРеквизитФормы(Дерево,"ОтборИерархия");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоКатегорий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Значение,
	|	Номенклатура.Наименование КАК Представление,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	ИСТИНА КАК Флаг
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование ИЕРАРХИЯ";
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВРеквизитФормы(Дерево,"ОтборКатегории");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьУслугиРесурсы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Значение,
	|	Номенклатура.Наименование КАК Представление,
	|	ИСТИНА КАК Флаг
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НЕ Номенклатура.ПометкаУдаления
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючевыеРесурсы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлючевыеРесурсы КАК КлючевыеРесурсы
	|ГДЕ
	|	НЕ КлючевыеРесурсы.ПометкаУдаления
	|	И НЕ КлючевыеРесурсы.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	НЕ ГрафикиРаботы.ПометкаУдаления
	|	И НЕ ГрафикиРаботы.Недействителен";
	
	Пакет = Запрос.ВыполнитьПакет();
	Если Пакет[0].Пустой() ИЛИ Пакет[1].Пустой() ИЛИ Пакет[2].Пустой() Тогда
		Элементы.ГруппаУслуги.Видимость = Ложь;
		Элементы.НастройкиУслуги.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКонстантыЗаписьНаУслугу(ДополнительныеПараметры)

	Если НЕ ДополнительныеПараметры.ИспользоватьРаботы Тогда
		Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Установить(Истина);
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.ПланироватьЗагрузкуРесурсов Тогда
		Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия.Установить(Истина);
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.ПланироватьЗагрузкуРесурсовПредприятияРаботы Тогда
		Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияРаботы.Установить(Истина);
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи Тогда
		Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПометкаПриИзменении(ИмяДерева)
	
	ТекущиеДанные = Элементы[ИмяДерева].ТекущиеДанные;
	НоменклатураВДокументахКлиентСервер.УстановитьФлагУПодчиненных(ТекущиеДанные.ПолучитьЭлементы(), "Флаг", ТекущиеДанные.Флаг);
	Если ТекущиеДанные.Флаг = Ложь Тогда
		НоменклатураВДокументахКлиентСервер.УстановитьФлагУРодителей(ТекущиеДанные, "Флаг", Ложь);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ОбновитьСписокШаблоновСайтов(ВыбранноеЗначение)
	
	Если СтрДлина(СокрЛП(ВыбранноеЗначение))<3 Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыБизнеса.Наименование,
	|	ВидыБизнеса.Синонимы
	|ПОМЕСТИТЬ ВТВидыБизнеса
	|ИЗ
	|	&ВидыБизнеса КАК ВидыБизнеса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВидыБизнеса.Синонимы
	|ИЗ
	|	ВТВидыБизнеса КАК ВТВидыБизнеса
	|ГДЕ
	|	ИСТИНА";
	
	Запрос.УстановитьПараметр("ВведенныйТекст", ВыбранноеЗначение);
	Запрос.УстановитьПараметр("ВидыБизнеса", ВидыБизнеса.Выгрузить());
	
	ВыбранноеЗначение = СтрЗаменить(ВыбранноеЗначение, ","," ");
	ВыбранноеЗначение = СтрЗаменить(ВыбранноеЗначение, "."," ");
	МассивСлов = СтрРазделить(ВыбранноеЗначение, " ", Ложь);
	
	Для н=1 По МассивСлов.Количество() Цикл
		Если СтрДлина(МассивСлов[н-1])<4 Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Парам"+н, "%"+МассивСлов[н-1]+"%");
		
		Запрос.Текст = Запрос.Текст + ?(н=1, " И ", " ИЛИ ")+ "ВТВидыБизнеса.Синонимы ПОДОБНО &Парам"+н;
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СловаСинонимы = Новый Соответствие;
	
	// Если синонимов очень много, значит введенный текст не релевантен (подходит сразу для всех бизнесов), тогда синонимы
	// не используем, ищем по прямому вхождению введенного текста в имя шаблона
	Если Выборка.Количество()<100 Тогда
		Пока Выборка.Следующий() Цикл
			МассивСловВыборки = СтрРазделить(Выборка.Синонимы, " ", Ложь);
			Для каждого стр Из МассивСловВыборки Цикл
				Если ТипСайта=4 И НРег(стр)="интернет" ИЛИ НРег(стр)="магазин" Тогда
					// эти слова есть в каждом шаблоне интернет-магазина
					Продолжить;
				ИначеЕсли НРег(стр)="сайт" ИЛИ НРег(стр)="адаптивный" Тогда
					// эти слова есть в каждом шаблоне
					Продолжить;
				КонецЕсли;
				
				Если СтрДлина(стр)>2 Тогда
					СловаСинонимы.Вставить(стр);	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
	СписокВыбранныхСлов = СтрРазделить(ВыбранноеЗначение, " ", Ложь);
	Для каждого ВыбранноеСлово Из СписокВыбранныхСлов Цикл
		Если СтрДлина(ВыбранноеСлово)<3 Тогда
			Продолжить;
		КонецЕсли;
		
		СловаСинонимы.Вставить(ВыбранноеСлово);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныСайтов.Идентификатор КАК Идентификатор,
	|	ШаблоныСайтов.Наименование КАК Наименование,
	|	ШаблоныСайтов.Картинка КАК Картинка,
	|	ШаблоныСайтов.ТипСайта КАК ТипСайта
	|ПОМЕСТИТЬ ВТШаблоныСайтов
	|ИЗ
	|	&ШаблоныСайтов КАК ШаблоныСайтов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТШаблоныСайтов.Идентификатор КАК Идентификатор,
	|	ВТШаблоныСайтов.Наименование КАК Наименование,
	|	ВТШаблоныСайтов.Картинка КАК Картинка,
	|	ВТШаблоныСайтов.ТипСайта КАК ТипСайта
	|ИЗ
	|	ВТШаблоныСайтов КАК ВТШаблоныСайтов
	|ГДЕ
	|	ВТШаблоныСайтов.ТипСайта = &ТипСайта";
	
	Запрос.УстановитьПараметр("ТипСайта", ТипСайтаПоНомеру(ТипСайта));
	Запрос.УстановитьПараметр("ШаблоныСайтов", ШаблоныСайтов.Выгрузить());
	
	н=1;
	Для каждого стр Из СловаСинонимы Цикл
		
		Если н>300 Тогда
			Прервать;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Парам"+н, "%"+стр.Ключ+"%");
		Запрос.Текст = Запрос.Текст + ?(н=1, " И (", " ИЛИ ")+ "ВТШаблоныСайтов.Наименование ПОДОБНО &Парам"+н;
		
		н=н+1;
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + ?(н=1, "", " )");
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	СписокШаблонов = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокШаблонов.Добавить(Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокШаблонов;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьШаблоныССайта()

	АдресЗапроса = "https://api.umi.ru/get_design_templates_list";
		
	ОписаниеОшибки = "";
	ОтветСервера = "";
	Соединение = Неопределено;
	
	ПараметрыПодключения = Новый Структура("АдресСайта, Логин, Пароль, УчетнаяЗапись", АдресЗапроса,"","");
	ИнтеграцияСИнтернетМагазиномСервер.ПолучитьНастройкиПодключения(ПараметрыПодключения, ОписаниеОшибки);
	
	ИнтеграцияСИнтернетМагазиномСервер.ВыполнитьАвторизациюДляСоединения(Соединение, ПараметрыПодключения, ОтветСервера, ОписаниеОшибки);
	Если ЗначениеЗаполнено(ОтветСервера) И Лев(ОтветСервера,2)="{""" Тогда 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветСервера);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
		
		Если ТипЗнч(Результат)=Тип("Соответствие") Тогда
			
			РезультатДанные = Результат.Получить("result");
			
			Шаблоны = РезультатДанные.Получить("templates");
			ТаблицаШаблонов = СоответствиеВТЗ(Шаблоны);
			
			Для Каждого стр Из ТаблицаШаблонов Цикл
			
				НовСтр = ШаблоныСайтов.Добавить();
				НовСтр.Наименование = стр.value;
				НовСтр.Идентификатор = стр.data;
				НовСтр.ТипСайта = стр.appId;
				НовСтр.Картинка = стр.img;
			КонецЦикла; 
			ШаблоныСайтов.Сортировать( "Наименование" );
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяСайтаИзИмениОрганизации()
	
	ИмяСайтаТекст = СтроковыеФункции.СтрокаЛатиницей(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяОрганизация, "Наименование"));
	ИмяСайтаТекст = УбратьЗапрещенныеСимволы(ИмяСайтаТекст, "qwertyuiopasdfghjklzxcvbnm01234567890-");
	
	Возврат ИмяСайтаТекст;

КонецФункции

&НаСервере
Процедура ЗаполнитьГруппыКатегории()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура.Ссылка) КАК КоличествоГрупп,
	|	0 КАК КоличествоКатегорий
	|ПОМЕСТИТЬ втКоличества
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КатегорииНоменклатуры.Ссылка)
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	КатегорииНоменклатуры.Ссылка <> ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.БезКатегории)
	|	И НЕ КатегорииНоменклатуры.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втКоличества.КоличествоГрупп) КАК КоличествоГрупп,
	|	СУММА(втКоличества.КоличествоКатегорий) КАК КоличествоКатегорий
	|ИЗ
	|	втКоличества КАК втКоличества";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КоличествоГрупп = Выборка.КоличествоГрупп;
		КоличествоКатегорий = Выборка.КоличествоКатегорий;
		ВсегоГруппКатегорий = КоличествоКатегорий + КоличествоГрупп;
	КонецЦикла;
	
	Если ВсегоГруппКатегорий = 0 Тогда
		ОтборКатегорииГруппыПереключатель = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры;
		Элементы.ГруппаВыбратьНоменклатуру.Видимость = Ложь;
		Элементы.ГруппаЗапасыФлажки.Видимость = Ложь;
		Элементы.СтраницыКатегорииИерархия.Видимость = Ложь;
		Элементы.ГруппаВыбратьНоменклатуру.ОтображатьЗаголовок = Ложь;
	ИначеЕсли КоличествоГрупп = 0 Тогда
	    ОтборКатегорииГруппыПереключатель = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры;
		Элементы.ГруппаЗапасыФлажки.Видимость = Ложь;
		Элементы.ГруппаВыбратьНоменклатуру.Заголовок = НСтр("ru = 'Выберите категории номенклатуры для переноса на сайт'");
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.КатегорииОтбор;
		
		ЗаполнитьДеревоКатегорий();
		
	ИначеЕсли КоличествоКатегорий = 0 Тогда
	    ОтборКатегорииГруппыПереключатель = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры;
		Элементы.ГруппаЗапасыФлажки.Видимость = Ложь;
		Элементы.ГруппаВыбратьНоменклатуру.Заголовок = НСтр("ru = 'Выберите группы номенклатуры для переноса на сайт'");
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.ГруппыОтбор;
		
		ЗаполнитьДеревоГрупп();
		
	Иначе
		// всё показываем, открываем страницу с категориями
		ОтборКатегорииГруппыПереключатель = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры;
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.КатегорииОтбор;
		
		ЗаполнитьДеревоГрупп();
		ЗаполнитьДеревоКатегорий();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактирования(ТекСтрока = Неопределено)
	
	Если ТекСтрока = Неопределено Тогда
		ПараметрыФормы = Новый Структура("ИсточникЗаписи, НовыйСайт", 
			ПредопределенноеЗначение("Перечисление.ЗаписьНаУслугиИсточник.Сайт"),
			Истина);
	ИначеЕсли ТекСтрока.РодительскаяГруппировкаСтроки = Неопределено Тогда
		ПараметрыФормы = Новый Структура("Услуга, ИсточникЗаписи, НовыйСайт", 
			ТекСтрока.Услуга, 
			ПредопределенноеЗначение("Перечисление.ЗаписьНаУслугиИсточник.Сайт"), 
			Истина);
	Иначе
   		ПараметрыФормы = Новый Структура("Услуга, ИсточникЗаписи, НовыйСайт", 
			ТекСтрока.РодительскаяГруппировкаСтроки.Ключ, 
			ПредопределенноеЗначение("Перечисление.ЗаписьНаУслугиИсточник.Сайт"), 
			Истина);
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаРедактированияОбработкаВыбора", ЭтотОбъект);	
	ОткрытьФорму("РегистрСведений.НастройкиЗаписьНаУслуги.Форма.ФормаРедактирования", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСайтаПриИзменении(Элемент)
	ОбновитьВидимостьНастроек();
КонецПроцедуры

&НаСервере
Процедура МенюСтраницЗаполнить() Экспорт
	
	МенюСтраницСтрока = МенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Тип сайта";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаТипСайта";
	МенюСтраницСтрока.НомерКартинки = 0;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Истина;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
	МенюСтраницСтрока = МенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Настройки";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаНастройкиСайта";
	МенюСтраницСтрока.НомерКартинки = 9;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Ложь;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
	МенюСтраницСтрока = МенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Иерархия";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаИерархияНаСайте";
	МенюСтраницСтрока.НомерКартинки = 5;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Ложь;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();

	МенюСтраницСтрока = МенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Услуги";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаУслуги";
	МенюСтраницСтрока.НомерКартинки = 2;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Ложь;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();

	МенюСтраницСтрока = МенюСтраниц.Добавить();
	МенюСтраницСтрока.Наименование = "Завершение";
	МенюСтраницСтрока.ИмяСтраницы = "СтраницаЗавершение";
	МенюСтраницСтрока.НомерКартинки = 3;
	МенюСтраницСтрока.ДоступностьСтраницы = Истина;
	МенюСтраницСтрока.ДоступностьСтраницыДляПереключения = Ложь;
	МенюСтраницСтрока.ПоляСтраницыЗаполненыКорректно = Истина;
	МенюСтраницСтрока.ВтораяКартинкаСтроки = КаналыПродажКлиентСервер.МенюСтраницВтораяКартинкаНомерПустая();
	
КонецПроцедуры

&НаКлиенте
Функция МенюСтраницПоляСтраницыЗаполненыКорректно( ИмяСтраницы ) Экспорт
	
	Результат = Истина;
	
	ОчиститьСообщения();
	
	Если ИмяСтраницы = "СтраницаТипСайта" Тогда
		
		Если ПринимаюСоглашение = Ложь Тогда
			Результат = Ложь;

			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо принять лицензионное соглашение.'"),,
			"ПринимаюСоглашение" );
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницы = "СтраницаНастройкиСайта" Тогда
		
		Если ПустаяСтрока( EmailРегистрацииСайта ) Тогда
			Результат = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите e-mail, на который будет зарегистрирован сайт.'"),,
			"EmailРегистрацииСайта" );
			
		Иначе

			Если ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям( EmailРегистрацииСайта ) = Ложь Тогда
				Результат = Ложь;
			
				ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'E-mail задан некорректно.'"),,
				"EmailРегистрацииСайта" );
			КонецЕсли;

		КонецЕсли;

		Если ПустаяСтрока( ИмяСайта ) Тогда
			Результат = Ложь;

			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Заполните адрес сайта.'"),,
			"ИмяСайта" );
		Иначе
			Если ИмяСайтаСвободно = Ложь Тогда
				Результат = Ложь;

				ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Адрес сайта занят, выберите другое имя сайта.'"),,
				"ИмяСайта" );
			КонецЕсли;
		КонецЕсли;
		
		Если ПустаяСтрока( ШаблонСайтаОписание ) Тогда
			Результат = Ложь;

			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Заполните шаблон сайта.'"),,
			"ШаблонСайтаОписание" );
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено( ОсновнаяОрганизация ) Тогда
			Результат = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Заполните организацию.'"),,
			"ОсновнаяОрганизация" );
		КонецЕсли;

		Если Элементы.ВидЦен.Доступность
		И Не ЗначениеЗаполнено( ВидЦен ) Тогда
			Результат = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Заполните вид цен.'"),,
			"ВидЦен" );
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницы = "СтраницаЗавершение" Тогда
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура МенюСтраницНастройкиФормыОбновить( ИмяСтраницы ) Экспорт

	Если ИмяСтраницы = "СтраницаТипСайта" Тогда
	
		Элементы.МенюСтраницНазад.Видимость = Ложь;
		Элементы.МенюСтраницВперед.Видимость = Истина;
		Элементы.СоздатьСайт.Видимость = Ложь;
		
	ИначеЕсли ИмяСтраницы = "СтраницаЗавершение" Тогда
	
		Элементы.МенюСтраницНазад.Видимость = Истина;
		Элементы.МенюСтраницВперед.Видимость = Ложь;
		Элементы.СоздатьСайт.Видимость = Истина;

		Элементы.СоздатьСайт.Важность = ВажностьКнопки.Главная;
		Элементы.СоздатьСайт.КнопкаПоУмолчанию = Истина;
		
	Иначе
	
		Элементы.МенюСтраницНазад.Видимость = Истина;
		Элементы.МенюСтраницВперед.Видимость = Истина;
		Элементы.СоздатьСайт.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Элементы.МенюСтраницВперед.Видимость = Истина Тогда
		Элементы.МенюСтраницВперед.Важность = ВажностьКнопки.Главная;
		Элементы.МенюСтраницВперед.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МенюСтраницПерейтиПриАктивизацииСтроки()
	КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект );
КонецПроцедуры

&НаКлиенте
Процедура МенюСтраницВперед(Команда)
	КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект, 1 );
КонецПроцедуры

&НаКлиенте
Процедура МенюСтраницНазад(Команда)
	КаналыПродажКлиент.МенюСтраницПерейти( ЭтотОбъект, -1 );
КонецПроцедуры

#КонецОбласти
